Revit 2026 API

# GradientInterpolationType Enumeration

---

The enumerated type representing the permitted values for the asset property "GradientInterpolation" from the "Gradient" schema.

**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum GradientInterpolationType
```
```vb
Public Enumeration GradientInterpolationType
```
```cpp
public enum class GradientInterpolationType
```
```fsharp
type GradientInterpolationType
```

| Member name | Value | Description |
| --- | --- | --- |
| Custom | 0 |  |
| Easein | 1 |  |
| Easeinout | 2 |  |
| Easeout | 3 |  |
| Linear | 4 |  |
| Solid | 5 |  |

#### Reference

Autodesk.Revit.DB.Visual Namespace